# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [2]:
import pandas as pd
import numpy as np

In [50]:
df=pd.DataFrame(data=np.random.rand(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [51]:
df

          W         X         Y         Z
A  0.561044  0.582897  0.526783  0.016144
B  0.717784  0.986455  0.241024  0.803026
C  0.374020  0.501699  0.796578  0.055840
D  0.537726  0.411204  0.060754  0.122179
E  0.861862  0.585498  0.926444  0.475356

**Selection and indexing**

Lets learn the various methods to grab data from a dataframe.

In [7]:
df['W']

A    0.199533
B    0.986475
C    0.145113
D    0.955727
E    0.101120
Name: W, dtype: float64

Pass a list of column names

In [8]:
df[['Y','Z']]

          Y         Z
A  0.240555  0.134140
B  0.468949  0.988386
C  0.525408  0.142412
D  0.423985  0.066467
E  0.389441  0.460512

In [9]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.199533
B    0.986475
C    0.145113
D    0.955727
E    0.101120
Name: W, dtype: float64

DataFrame Columns are just Series

In [11]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [12]:
df['new']=df['W']+df['X']

In [13]:
df

          W         X         Y         Z       new
A  0.199533  0.595687  0.240555  0.134140  0.795220
B  0.986475  0.441620  0.468949  0.988386  1.428095
C  0.145113  0.908837  0.525408  0.142412  1.053949
D  0.955727  0.779681  0.423985  0.066467  1.735409
E  0.101120  0.141808  0.389441  0.460512  0.242927

Removing Columns

In [19]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.199533  0.595687  0.240555  0.134140
B  0.986475  0.441620  0.468949  0.988386
C  0.145113  0.908837  0.525408  0.142412
D  0.955727  0.779681  0.423985  0.066467
E  0.101120  0.141808  0.389441  0.460512

In [20]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.199533  0.595687  0.240555  0.134140  0.795220
B  0.986475  0.441620  0.468949  0.988386  1.428095
C  0.145113  0.908837  0.525408  0.142412  1.053949
D  0.955727  0.779681  0.423985  0.066467  1.735409
E  0.101120  0.141808  0.389441  0.460512  0.242927

In [22]:
df.drop('new',axis=1,inplace=True)

In [23]:
df

          W         X         Y         Z
A  0.199533  0.595687  0.240555  0.134140
B  0.986475  0.441620  0.468949  0.988386
C  0.145113  0.908837  0.525408  0.142412
D  0.955727  0.779681  0.423985  0.066467
E  0.101120  0.141808  0.389441  0.460512

* can drop row this way

In [24]:
df.drop('A',axis=0,inplace=True)

In [25]:
df

          W         X         Y         Z
B  0.986475  0.441620  0.468949  0.988386
C  0.145113  0.908837  0.525408  0.142412
D  0.955727  0.779681  0.423985  0.066467
E  0.101120  0.141808  0.389441  0.460512

* Selecting Rows

In [26]:
df.loc['B']

W    0.986475
X    0.441620
Y    0.468949
Z    0.988386
Name: B, dtype: float64

In [27]:
df.loc[['B','C']]

          W         X         Y         Z
B  0.986475  0.441620  0.468949  0.988386
C  0.145113  0.908837  0.525408  0.142412

Or select based off of position instead of label

In [28]:
df.iloc[1]

W    0.145113
X    0.908837
Y    0.525408
Z    0.142412
Name: C, dtype: float64

 Selecting subset of rows and columns

In [29]:
df.loc['B','W']

0.9864753258827978

In [30]:
df.loc[['B','C'],['Y','Z']]

          Y         Z
B  0.468949  0.988386
C  0.525408  0.142412

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [31]:
df

          W         X         Y         Z
B  0.986475  0.441620  0.468949  0.988386
C  0.145113  0.908837  0.525408  0.142412
D  0.955727  0.779681  0.423985  0.066467
E  0.101120  0.141808  0.389441  0.460512

In [32]:
df>0.5

       W      X      Y      Z
B   True  False  False   True
C  False   True   True  False
D   True   True  False  False
E  False  False  False  False

In [33]:
df[df>0.5]

          W         X         Y         Z
B  0.986475       NaN       NaN  0.988386
C       NaN  0.908837  0.525408       NaN
D  0.955727  0.779681       NaN       NaN
E       NaN       NaN       NaN       NaN

In [34]:
df[df['W']>0.5]

          W         X         Y         Z
B  0.986475  0.441620  0.468949  0.988386
D  0.955727  0.779681  0.423985  0.066467

In [35]:
df[df['W']>0.5]['W']

B    0.986475
D    0.955727
Name: W, dtype: float64

In [37]:
df[df['X']>0.5][['W','Z']]

          W         Z
C  0.145113  0.142412
D  0.955727  0.066467

For two conditions you can use | and & with parenthesis:

In [42]:
(df['Y']>0.4) & (df['Z']>0.2)

B     True
C    False
D    False
E    False
dtype: bool

In [43]:
df[(df['Y']>0.4) & (df['Z']>0.2)]

          W        X         Y         Z
B  0.986475  0.44162  0.468949  0.988386

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [52]:
df

          W         X         Y         Z
A  0.561044  0.582897  0.526783  0.016144
B  0.717784  0.986455  0.241024  0.803026
C  0.374020  0.501699  0.796578  0.055840
D  0.537726  0.411204  0.060754  0.122179
E  0.861862  0.585498  0.926444  0.475356

In [55]:
addnew='QQ NN MM LL JJ'.split()

In [56]:
df['Add']=addnew

In [57]:
df

          W         X         Y         Z Add
A  0.561044  0.582897  0.526783  0.016144  QQ
B  0.717784  0.986455  0.241024  0.803026  NN
C  0.374020  0.501699  0.796578  0.055840  MM
D  0.537726  0.411204  0.060754  0.122179  LL
E  0.861862  0.585498  0.926444  0.475356  JJ

In [58]:
df.set_index('Add')

            W         X         Y         Z
Add
QQ   0.561044  0.582897  0.526783  0.016144
NN   0.717784  0.986455  0.241024  0.803026
MM   0.374020  0.501699  0.796578  0.055840
LL   0.537726  0.411204  0.060754  0.122179
JJ   0.861862  0.585498  0.926444  0.475356

In [59]:
df

          W         X         Y         Z Add
A  0.561044  0.582897  0.526783  0.016144  QQ
B  0.717784  0.986455  0.241024  0.803026  NN
C  0.374020  0.501699  0.796578  0.055840  MM
D  0.537726  0.411204  0.060754  0.122179  LL
E  0.861862  0.585498  0.926444  0.475356  JJ

In [60]:
df.set_index('Add',inplace=True)

In [61]:
df

            W         X         Y         Z
Add
QQ   0.561044  0.582897  0.526783  0.016144
NN   0.717784  0.986455  0.241024  0.803026
MM   0.374020  0.501699  0.796578  0.055840
LL   0.537726  0.411204  0.060754  0.122179
JJ   0.861862  0.585498  0.926444  0.475356

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [1]:
import pandas as pd
import numpy as np
df=pd.DataFrame(data=np.random.rand(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [2]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [5]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [3]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [4]:
df

             A         B
G1 1 -0.880051  0.563078
   2 -0.249864  1.779607
   3 -0.214154 -0.883446
G2 1  0.291695 -0.575466
   2  1.025324 -0.601827
   3 -1.765372 -0.145805

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [7]:
df.loc['G1']

          A         B
1 -0.880051  0.563078
2 -0.249864  1.779607
3 -0.214154 -0.883446

In [8]:
df.loc['G1'].loc[1]

A   -0.880051
B    0.563078
Name: 1, dtype: float64

In [9]:
df.index.names

FrozenList([None, None])

In [10]:
df.index.names=['Group','Num']

In [11]:
df

                  A         B
Group Num
G1    1   -0.880051  0.563078
      2   -0.249864  1.779607
      3   -0.214154 -0.883446
G2    1    0.291695 -0.575466
      2    1.025324 -0.601827
      3   -1.765372 -0.145805

In [12]:
df.xs("G1")

            A         B
Num
1   -0.880051  0.563078
2   -0.249864  1.779607
3   -0.214154 -0.883446

In [17]:
df.xs(['G1',1])

C:\Users\PRADIP\AppData\Local\Temp\ipykernel_12104\580597333.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',1])

A   -0.880051
B    0.563078
Name: (G1, 1), dtype: float64

In [22]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.880051  0.563078
G2     0.291695 -0.575466